       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Agenor.

       PROCEDURE DIVISION.

           DISPLAY 'HELLO WORLD'.

           STOP RUN.
           